tap "caskformula/caskformula"
tap "homebrew/services"
tap "oclint/formulae"
tap "xcodesorg/made"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Simple, fast and user-friendly alternative to find
brew "fd"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Simple terminal UI for git commands
brew "lazygit"
# Library to render SVG files using Cairo
brew "librsvg"
# YAML Parser
brew "libyaml"
# Library for creating multi-platform software
brew "s-lang"
# Terminal-based visual file manager
brew "midnight-commander"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Prompt theme engine for any shell
brew "oh-my-posh"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Persistent key-value database, with built-in net interface
brew "redis"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Install various Ruby versions and implementations
brew "ruby-build"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# SMART hard drive monitoring
brew "smartmontools"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Markup-based typesetting system
brew "typst"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Yet Another Dotfiles Manager
brew "yadm"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "1yib.rust-bundle"
vscode "aeschli.vscode-css-formatter"
vscode "andrejunges.handlebars"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "chaunceykiwi.json-tree-view"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dooez.alt-catppuccin-vsc"
vscode "dustypomerleau.rust-syntax"
vscode "eriklynd.json-tools"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gurayyarar.dummytextgenerator"
vscode "janisdd.vscode-edit-csv"
vscode "laurenttreguier.uncrustify"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mechatroner.rainbow-csv"
vscode "mhcpnl.xcodestrings"
vscode "mitaki28.vscode-clang"
vscode "mitchdenny.ecdc"
vscode "mohd-akram.vscode-html-format"
vscode "mohsen1.prettify-json"
vscode "mrcrowl.easy-less"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "nash.awesome-flutter-snippets"
vscode "ornithologist.ios-snippets"
vscode "richie5um2.vscode-statusbar-json-path"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tomoki1207.pdf"
vscode "wezzard.swift-intermediate-language"
vscode "yzhang.markdown-all-in-one"
